index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-12-23 Tue 17:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>notes index.org&lt;notes&gt;</title>
<meta name="author" content="Tyler Maxwell" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">notes index.org&lt;notes&gt;</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbaa71f7">1. introduction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></a></li>
<li><a href="#org71a029b">2. topics</a>
<ul>
<li><a href="#modern-philosophy">2.1. modern philosophy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></a></li>
<li><a href="#world-of-chemistry">2.2. world of chemistry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></a></li>
<li><a href="#chemistry">2.3. chemistry&#xa0;&#xa0;&#xa0;<span class="tag"><span class="science">science</span>&#xa0;<span class="teaching">teaching</span></span></a>
<ul>
<li><a href="#org26d9ce4">2.3.1. teaching</a></li>
</ul>
</li>
<li><a href="#org814a757">2.4. education&#xa0;&#xa0;&#xa0;<span class="tag"><span class="education">education</span></span></a></li>
<li><a href="#elisp">2.5. elisp&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a>
<ul>
<li><a href="#org491604f">2.5.1. intro to emacs</a></li>
</ul>
</li>
<li><a href="#org639bc97">2.6. haskell&#xa0;&#xa0;&#xa0;<span class="tag"><span class="coding">coding</span></span></a></li>
<li><a href="#how-to-take-smart-notes">2.7. How to Take Smart Notes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></a>
<ul>
<li><a href="#orgaf58624">2.7.1. everything you need to know</a></li>
<li><a href="#orga069a94">2.7.2. everything you need to do</a></li>
<li><a href="#orga757f73">2.7.3. everything you need to have</a></li>
<li><a href="#orgbeaad7d">2.7.4. a few things to keep in mind</a></li>
<li><a href="#orge297f0c">2.7.5. writing is the only thing that matters</a></li>
<li><a href="#org0370d59">2.7.6. simplicity is paramount</a></li>
<li><a href="#org2795bcb">2.7.7. nobody starts from scratch</a></li>
<li><a href="#orgdba9fd1">2.7.8. let the work carry you forward</a></li>
<li><a href="#orge307621">2.7.9. separate and interlocking tasks</a></li>
<li><a href="#orge6794a0">2.7.10. read for understanding</a></li>
<li><a href="#org621e854">2.7.11. take smart notes</a></li>
<li><a href="#orgf68526c">2.7.12. develop ideas</a></li>
<li><a href="#org58948e4">2.7.13. share your insight</a></li>
<li><a href="#org5d7242b">2.7.14. make it a habit</a></li>
<li><a href="#orga114b95">2.7.15. app</a></li>
</ul>
</li>
<li><a href="#org-mode">2.8. org-mode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></a>
<ul>
<li><a href="#org1f6b540">2.8.1. the org manual</a></li>
</ul>
</li>
<li><a href="#physics">2.9. physics&#xa0;&#xa0;&#xa0;<span class="tag"><span class="science">science</span>&#xa0;<span class="teaching">teaching</span></span></a></li>
<li><a href="#quotes">2.10. quotes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="reading">reading</span></span></a>
<ul>
<li><a href="#jesse-owens">2.10.1. Jesse Owens</a></li>
<li><a href="#niklas-luhmann">2.10.2. Niklas Luhmann</a></li>
</ul>
</li>
<li><a href="#orge54b420">2.11. science&#xa0;&#xa0;&#xa0;<span class="tag"><span class="science">science</span></span></a></li>
<li><a href="#teaching">2.12. teaching&#xa0;&#xa0;&#xa0;<span class="tag"><span class="teaching">teaching</span></span></a></li>
<li><a href="#math-of-life-and-death">2.13. The Math of Life and Death&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></a></li>
<li><a href="#org2252e43">2.14. zettelkasten&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></a></li>
</ul>
</li>
<li><a href="#org9fc9dd0">3. Bibliography</a></li>
</ul>
</div>
</div>



<div id="outline-container-orgbaa71f7" class="outline-2">
<h2 id="orgbaa71f7"><span class="section-number-2">1.</span> introduction&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h2>
<div class="outline-text-2" id="text-1">
<p>
In the interest of having a mimimum number of "buckets," This document will serve as a reference for notes. It seems the need for a separate directory for some topics rises immediately (i.e. <a href="#org639bc97">2.6</a>). 
</p>
</div>
</div>



<div id="outline-container-org71a029b" class="outline-2">
<h2 id="org71a029b"><span class="section-number-2">2.</span> topics</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-modern-philosophy" class="outline-3">
<h3 id="modern-philosophy"><span class="section-number-3">2.1.</span> modern philosophy&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></h3>
<div class="outline-text-3" id="text-modern-philosophy">
<p>
I like to (book:Scruton, Roger, 2012) 
</p>
</div>
</div>
<div id="outline-container-world-of-chemistry" class="outline-3">
<h3 id="world-of-chemistry"><span class="section-number-3">2.2.</span> <a href="content/worldOfChemistry/index.html">world of chemistry</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></h3>
<div class="outline-text-3" id="text-world-of-chemistry">
</div>
</div>
<div id="outline-container-chemistry" class="outline-3">
<h3 id="chemistry"><span class="section-number-3">2.3.</span> <a href="content/chemistry/index.html">chemistry</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="science">science</span>&#xa0;<span class="teaching">teaching</span></span></h3>
<div class="outline-text-3" id="text-chemistry">
</div>

<div id="outline-container-org26d9ce4" class="outline-4">
<h4 id="org26d9ce4"><span class="section-number-4">2.3.1.</span> <a href="#teaching">2.12</a></h4>
</div>
</div>
<div id="outline-container-org814a757" class="outline-3">
<h3 id="org814a757"><span class="section-number-3">2.4.</span> education&#xa0;&#xa0;&#xa0;<span class="tag"><span class="education">education</span></span></h3>
</div>
<div id="outline-container-elisp" class="outline-3">
<h3 id="elisp"><span class="section-number-3">2.5.</span> <a href="content/elisp/index.html">elisp</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h3>
<div class="outline-text-3" id="text-elisp">
</div>
<div id="outline-container-org491604f" class="outline-4">
<h4 id="org491604f"><span class="section-number-4">2.5.1.</span> <a href="https://www.gnu.org/software/emacs/manual/html_mono/eintr.html#Top">intro to emacs</a></h4>
</div>
</div>
<div id="outline-container-org639bc97" class="outline-3">
<h3 id="org639bc97"><span class="section-number-3">2.6.</span> haskell&#xa0;&#xa0;&#xa0;<span class="tag"><span class="coding">coding</span></span></h3>
<div class="outline-text-3" id="text-2-6">
</div>
</div>
<div id="outline-container-how-to-take-smart-notes" class="outline-3">
<h3 id="how-to-take-smart-notes"><span class="section-number-3">2.7.</span> How to Take Smart Notes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></h3>
<div class="outline-text-3" id="text-how-to-take-smart-notes">
<blockquote>
<p>
"One cannot think without writing."  
</p>
</blockquote>
</div>

<div id="outline-container-orgaf58624" class="outline-4">
<h4 id="orgaf58624"><span class="section-number-4">2.7.1.</span> everything you need to know</h4>
</div>
<div id="outline-container-orga069a94" class="outline-4">
<h4 id="orga069a94"><span class="section-number-4">2.7.2.</span> everything you need to do</h4>
</div>
<div id="outline-container-orga757f73" class="outline-4">
<h4 id="orga757f73"><span class="section-number-4">2.7.3.</span> everything you need to have</h4>
</div>
<div id="outline-container-orgbeaad7d" class="outline-4">
<h4 id="orgbeaad7d"><span class="section-number-4">2.7.4.</span> a few things to keep in mind</h4>
</div>
<div id="outline-container-orge297f0c" class="outline-4">
<h4 id="orge297f0c"><span class="section-number-4">2.7.5.</span> writing is the only thing that matters</h4>
</div>
<div id="outline-container-org0370d59" class="outline-4">
<h4 id="org0370d59"><span class="section-number-4">2.7.6.</span> simplicity is paramount</h4>
</div>
<div id="outline-container-org2795bcb" class="outline-4">
<h4 id="org2795bcb"><span class="section-number-4">2.7.7.</span> nobody starts from scratch</h4>
</div>
<div id="outline-container-orgdba9fd1" class="outline-4">
<h4 id="orgdba9fd1"><span class="section-number-4">2.7.8.</span> let the work carry you forward</h4>
</div>
<div id="outline-container-orge307621" class="outline-4">
<h4 id="orge307621"><span class="section-number-4">2.7.9.</span> separate and interlocking tasks</h4>
</div>
<div id="outline-container-orge6794a0" class="outline-4">
<h4 id="orge6794a0"><span class="section-number-4">2.7.10.</span> read for understanding</h4>
</div>
<div id="outline-container-org621e854" class="outline-4">
<h4 id="org621e854"><span class="section-number-4">2.7.11.</span> take smart notes</h4>
</div>
<div id="outline-container-orgf68526c" class="outline-4">
<h4 id="orgf68526c"><span class="section-number-4">2.7.12.</span> develop ideas</h4>
</div>
<div id="outline-container-org58948e4" class="outline-4">
<h4 id="org58948e4"><span class="section-number-4">2.7.13.</span> share your insight</h4>
</div>
<div id="outline-container-org5d7242b" class="outline-4">
<h4 id="org5d7242b"><span class="section-number-4">2.7.14.</span> make it a habit</h4>
</div>
<div id="outline-container-orga114b95" class="outline-4">
<h4 id="orga114b95"><span class="section-number-4">2.7.15.</span> app</h4>
<div class="outline-text-4" id="text-2-7-15">
<blockquote>
<p>
Note sequences occupy the sweet spot between isolated facts/ideas and continuous text. They are what the Zettelkasten is all about. Therefore: Make sure a new note is written, whenever possible, in direct response to an existing note, continuing the dialogue.
</p>

<p>
If your program allows linking to individual blocks within a page, feel free to write whole note sequences on a single page with each block (or paragraph) as a single note. As long as you treat each block (or paragraph) as a stand-alone note, addressable from anywhere else, you keep the granularity of your notes while benefitting from a better overview over an existing thread.
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-org-mode" class="outline-3">
<h3 id="org-mode"><span class="section-number-3">2.8.</span> org-mode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span></span></h3>
<div class="outline-text-3" id="text-org-mode">
</div>
<div id="outline-container-org1f6b540" class="outline-4">
<h4 id="org1f6b540"><span class="section-number-4">2.8.1.</span> <a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Top">the org manual</a></h4>
<div class="outline-text-4" id="text-2-8-1">
</div>
<ol class="org-ol">
<li><a id="hyperlinks"></a><a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#hyperlink">hyperlinks</a><br />
<div class="outline-text-5" id="text-hyperlinks">
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-physics" class="outline-3">
<h3 id="physics"><span class="section-number-3">2.9.</span> <a href="content/physics/index.html">physics</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="science">science</span>&#xa0;<span class="teaching">teaching</span></span></h3>
<div class="outline-text-3" id="text-physics">
</div>
</div>
<div id="outline-container-quotes" class="outline-3">
<h3 id="quotes"><span class="section-number-3">2.10.</span> quotes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="reading">reading</span></span></h3>
<div class="outline-text-3" id="text-quotes">
</div>
<div id="outline-container-jesse-owens" class="outline-4">
<h4 id="jesse-owens"><span class="section-number-4">2.10.1.</span> Jesse Owens</h4>
<div class="outline-text-4" id="text-jesse-owens">
<p>
"The battles that count aren't the ones for gold medals. The struggle within yourself - the invisible, inevitable battles inside all of us - that's where it's at."
</p>
</div>
</div>
<div id="outline-container-niklas-luhmann" class="outline-4">
<h4 id="niklas-luhmann"><span class="section-number-4">2.10.2.</span> Niklas Luhmann</h4>
<div class="outline-text-4" id="text-niklas-luhmann">
<p>
"One cannot think without writing."
</p>
</div>
</div>
</div>
<div id="outline-container-orge54b420" class="outline-3">
<h3 id="orge54b420"><span class="section-number-3">2.11.</span> science&#xa0;&#xa0;&#xa0;<span class="tag"><span class="science">science</span></span></h3>
</div>
<div id="outline-container-teaching" class="outline-3">
<h3 id="teaching"><span class="section-number-3">2.12.</span> teaching&#xa0;&#xa0;&#xa0;<span class="tag"><span class="teaching">teaching</span></span></h3>
<div class="outline-text-3" id="text-teaching">
</div>
</div>
<div id="outline-container-math-of-life-and-death" class="outline-3">
<h3 id="math-of-life-and-death"><span class="section-number-3">2.13.</span> The Math of Life and Death&#xa0;&#xa0;&#xa0;<span class="tag"><span class="book">book</span></span></h3>
<div class="outline-text-3" id="text-math-of-life-and-death">
</div>
</div>
<div id="outline-container-org2252e43" class="outline-3">
<h3 id="org2252e43"><span class="section-number-3">2.14.</span> zettelkasten&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
</div>
</div>

<div id="outline-container-org9fc9dd0" class="outline-2">
<h2 id="org9fc9dd0"><span class="section-number-2">3.</span> Bibliography</h2>
<div class="outline-text-2" id="text-3">
<p>
Scruton, Roger (2012). <i>Modern Philosophy: A Survey</i>, Bloomsbury Reader.</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tyler Maxwell</p>
<p class="date">Created: 2025-12-23 Tue 17:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
